&НаСервере
Процедура ЗаполнитьОстатки()
    Остатки.Загрузить(РегистрыНакопления.Кошельки.Остатки());
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗатраты()
    Затраты.Загрузить(РегистрыНакопления.Затраты.Обороты());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
	ЗаполнитьОстатки();
    ЗаполнитьЗатраты();
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиОбновить(Команда)
	// Вставить содержимое обработчика.
	ЗаполнитьОстатки();
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыОбновить(Команда)
	// Вставить содержимое обработчика.
	ЗаполнитьЗатраты();
КонецПроцедуры
